Revit 2027 API
SlabShapeEditor.CreateCreasesFromFoldingLines Method
 Convert selected folding lines to split lines
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void CreateCreasesFromFoldingLines(
	Element hostObj,
	IList<Reference> references
)
Public Sub CreateCreasesFromFoldingLines (
	hostObj As Element,
	references As IList(Of Reference)
)
public:
void CreateCreasesFromFoldingLines(
	Element^ hostObj,
	IList<Reference^>^ references
)
member CreateCreasesFromFoldingLines :
        hostObj : Element *
        references : IList<Reference> -> unit
Parameters
hostObj Element
 object that hosts the SlabShapeEditor
references IList<Reference>
 References of selected folding lines.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  this operation failed.
See Also
Reference
SlabShapeEditor Class
Autodesk.Revit.DB Namespace